{
  "author": null,
  "description": "Ukraine reported heavy Russian shelling in the eastern Luhansk and Donetsk regions, while forces are locked in brutal urban combat in the flashpoint city of Bakhmut. Follow live updates here.",
  "image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/443bcd99-cc87-4c00-b98a-c8cdb9c7c003.jpg",
  "title": "European airline will suspend all flights to Moldovan capital due to “recent developments”",
  "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-02-27-23/h_3ad7bf5ac0516bbcc00bf751e5715b75",
  "content": "<DIV class=\"page\" id=\"readability-page-1\"><div id=\"posts-and-button\"><article id=\"h_3ad7bf5ac0516bbcc00bf751e5715b75\"><header><span>4 hr 44 min ago</span><h2>European airline will suspend all flights to Moldovan capital due to \"recent developments\"</h2><p>From CNN’s Tim Lister</p></header><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/443bcd99-cc87-4c00-b98a-c8cdb9c7c003.jpg\" alt=\"Wizz Air passenger aircrafts fly in and out of Berlin Brandenburg Airport in Germany in 2022. \"><figcaption>Wizz Air passenger aircrafts fly in and out of Berlin Brandenburg Airport in Germany in 2022.  (Patrick Pleul/picture-alliance/dpa/AP)</figcaption></figure></div><p>European low-cost carrier Wizz Air is suspending all its flights to the Moldovan capital of Chisinau starting on March 14 due to some “recent developments” in the country, the airline said.&nbsp;</p><div><blockquote>\"As a result of recent developments in Moldova and the high, but not imminent, risk in the country's airspace, Wizz Air has taken the difficult but responsible decision to suspend all flights to Chisinau starting on March 14,” it said in a statement on Monday.&nbsp;</blockquote></div><p>The company didn’t specify the recent developments it was referring to.&nbsp;</p><p>Tensions have been mounting in Moldova, as the country's President Maia Sandu has accused Russia of using “saboteurs” to stoke unrest amid a period of political instability, echoing similar warnings from Ukrainian President Volodymyr Zelensky.&nbsp;</p><p><em>With previous reporting from Radina Gigova.</em></p></div></article><article id=\"h_96c94ae8732900ba575c5875cb4b3906\"><header><span>5 hr 48 min ago</span><h2>NATO bid talks with Sweden and Finland will resume on March 9, Turkish foreign minister says</h2><p>From CNN's Isil Sariyuce and Sugam Pokharel&nbsp;&nbsp;</p></header><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/88c3bbea-f813-4c10-b273-6dcfe078c6ec.jpg\" alt=\"Turkish Foreign Minister Mevlut Cavusoglu speaks during a press conference held with his Hungarian counterpart after their meeting in Ankara, Turkey, on February 27.\"><figcaption>Turkish Foreign Minister Mevlut Cavusoglu speaks during a press conference held with his Hungarian counterpart after their meeting in Ankara, Turkey, on February 27. (Adam Altan/AFP/Getty Images)</figcaption></figure></div><p>Turkey’s talks with Sweden and Finland on the Nordic countries’ NATO&nbsp;accession&nbsp;bid will resume on March 9, Turkish Foreign Minister Mevlut Cavusoglu said on Monday.&nbsp;</p><p>Cavusoglu said in a televised news conference that “there are commitments (Sweden made) for NATO membership. It is not possible for us to say yes to Sweden's NATO membership without seeing these steps.”</p><p><strong>More on the talks: </strong>Ankara in January had suspended talks with Stockholm and Helsinki over the burning of the Quran at a protest in Sweden.&nbsp;</p><p>Sweden and Finland applied last year to join NATO following Russia’s invasion of Ukraine, but all 30 member states, including Turkey, must approve their bids.&nbsp;</p><p>Turkey has said Sweden in particular must first take a clearer stance against what it sees as terrorists, mainly Kurdish militants and a group it blames for a 2016 coup attempt.&nbsp;</p></div></article><article id=\"h_5b6fd9a4da4a91cda4c45b9e038183a9\"><header><span>6 hr 39 min ago</span><h2>Ukraine expects the US will provide more than $10 billion in budget support, prime minister says</h2><p>From CNN's Maria Kostenko in Kyiv</p></header><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/92df6f67-ce8b-41eb-8ccb-51f93693e58d.jpg\" alt=\"US Treasury Secretary Janet Yellen and Ukrainian Prime Minister Denys Shmyhal hold a joint press conference in Kyiv on Monday.\"><figcaption>US Treasury Secretary Janet Yellen and Ukrainian Prime Minister Denys Shmyhal hold a joint press conference in Kyiv on Monday. (Thibault Camus/AP)</figcaption></figure></div><p>Ukrainian Prime Minister Denys Shmyhal says the country's budget deficit this year is expected to amount to $38 billion, but that the US is committing to provide more than $10 billion in budget support by September.</p><p>Shmyhal was speaking after talks in Kyiv with&nbsp;US Treasury Secretary Janet Yellen.</p><p>\"In 2022, the United States was the leader among all partner countries in terms of financial assistance provided,\" Shmyhal said, providing $13 billion in grant support for the budget.</p><p>\"These funds were allocated for healthcare, education, social and humanitarian aid programs.\"</p><p>This year, he said, \"The United States has committed to provide Ukraine with more than $10 billion by September. In addition, the United States supports Ukraine in its rapid recovery. Namely, they have allocated $1.5 billion for this purpose, and another $1.1 billion to support the rapid recovery of the energy sector of Ukraine and Moldova.\"</p><p>Shmyhal said a new platform was being introduced to help coordinate the work of the G7 countries and international financial organizations, including the IMF and the World Bank, with regard to financial support for Ukraine.\"</p><p>Shmyhal said he and Yellen had also discussed the financial and sanctions impact on the Russian budget. \"We also discussed the continuation and effectiveness of sanctions on the supply of high-tech items to be used in the military sphere of Russia.\"</p></div></article><article id=\"h_953436a1ec0f8e35bc6282554353b616\"><header><span>6 hr 4 min ago</span><h2>Ukrainian commander says he reiterated need for F-16 fighter aircraft to top US general&nbsp;</h2><p>From Maria Kostenko in Kyiv</p></header><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e4f7e5c3-7f80-4a8e-a397-10c0a7b61232.JPG\" alt=\"Gen. Valerii Zaluzhnyi attends a ceremony dedicated to the first anniversary of the Russian invasion of Ukraine in Kyiv on Friday.\"><figcaption>Gen. Valerii Zaluzhnyi attends a ceremony dedicated to the first anniversary of the Russian invasion of Ukraine in Kyiv on Friday. (Ukrainian Presidential Press Service via Reuters)</figcaption></figure></div><p>The commander-in-chief of the Ukrainian Armed Forces said he spoke to the top US general on Monday and reiterated the need to strengthen Kyiv's air defense through the F-16 multi-role fighter aircraft. </p><p>The United States has consistently said that it <a href=\"https://www.cnn.com/2023/02/25/politics/zelensky-republicans-weapons/index.html\" target=\"_blank\">has no plans to send F-16s</a> to Ukraine.&nbsp;</p><p>Gen. Valerii Zaluzhnyi said he also spoke to Gen. Mark Milley about the supply of military equipment, weapons and ammunition, the situation on the front lines, and further plans of the forces regarding the defense of Ukraine.</p><div><blockquote>\"Each shell received — each piece of material — mean the preserved lives of the Ukrainian soldiers and peaceful civilians. We're hanging in there because of the support of our partners and we will definitely prevail,\" Zaluzhnyi added.</blockquote></div></div></article><article id=\"h_587a217754bbc17333e5fc0c17446a9c\"><header><span>7 hr 3 min ago</span><h2>US Treasury secretary says she expects to see \"an increasing toll on Russia’s economic trajectory over time\" </h2><p>From CNN's Alicia Wallace</p></header><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/81b67017-3e2f-4774-a1b9-7e6ee1b30065.jpg\" alt=\"US Treasury Secretary Janet Yellen speaks during a press conference in Kyiv, Ukraine, on Monday.\"><figcaption>US Treasury Secretary Janet Yellen speaks during a press conference in Kyiv, Ukraine, on Monday. (Thibault Camus/AP)</figcaption></figure></div><p>While the <a href=\"https://www.cnn.com/2023/02/22/business/russia-economy-ukraine-anniversary/index.html\" target=\"_blank\">Russian economy</a> has not <a href=\"https://www.cnn.com/2023/02/26/business/larry-summers-russia-ukraine-economy/index.html\" target=\"_blank\">yet buckled</a> under the wide array of sanctions from the United States and other Western countries, Treasury Secretary Janet Yellen said Monday she expects it to grow weaker over time as the country loses foreign investment and runs through its reserves and rainy-day funds.</p><div><blockquote>“We will see an increasing toll on Russia’s economic trajectory over time,” <a href=\"https://www.cnn.com/2023/02/27/economy/yellen-inflation-debt-ceiling-ukraine/index.html\" target=\"_blank\">she told CNN</a> in an exclusive interview during her unannounced visit to Kyiv. “And their ability to replenish the military equipment that’s been destroyed in their attacks on Ukraine — that’s been very greatly jeopardized.”&nbsp;</blockquote></div><p>Still,&nbsp;<a href=\"https://www.cnn.com/2023/02/24/politics/us-intelligence-china-drones-russia-ukraine/index.html\" target=\"_blank\">recent US intelligence has shown</a>&nbsp;that China is considering increasing&nbsp;<a href=\"https://www.cnn.com/2023/02/22/economy/china-russia-economic-ties-ukraine-intl-hnk/index.html\" target=\"_blank\">its support of the Russian economy</a>&nbsp;and war efforts, including supplying drones and ammunition.</p><p>Such a move would bring “severe” consequences, Yellen said.</p><p>“We have been extremely clear that we will not tolerate systematic violations by any country of the sanctions that we have put in place that are intended to deprive Russia of access to military equipment to wage this war,” she said. “And we have been very clear with the Chinese government and have made clear to Chinese firms and financial institutions that the consequences of violating those sanctions would be very severe.”</p></div></article><article id=\"h_60e9b9e38b00fcc73e51ff173a0bbcc1\"><header><span>7 hr 19 min ago</span><h2>US \"very much\" hopes Russia still interested in arms control, State Department official says </h2><p>From CNN's Jennifer Hansler</p></header><div><p>The United States “very much” hopes that Russia is still interested in arms control, but recent comments by Russian President Vladimir Putin call that interest into question, a top State Department official said Monday.</p><p>“It’s obviously in their domestic interest, and in our interest, and in the global security interest for us to continue to have these discussions,” Assistant Secretary for the Bureau of Arms Control, Verification, and Compliance Mallory Stewart said at an event at Brookings Institution.</p><div><blockquote>“We will meet with them. We need to meet with them. It’s something that both countries need to do to continue to focus on international stability and risk reduction,” she said.&nbsp;</blockquote></div><p>However, Stewart noted that “the communications that we’ve heard from Putin seem to place in doubt the assumptions that we’ve always had that they do value arms control.”</p><p>“By tying it to Ukraine right now, tying it to an immovable object in the sense that our support for Ukraine will not be limited by their New START decision, they’re really placing in doubt their support for the treaty itself,” she said.</p><p><strong>More context: </strong>Putin announced last week that Russia would <a href=\"https://www.cnn.com/2023/02/21/politics/nuclear-weapons-new-start-treaty-what-matters/index.html\" target=\"_blank\">suspend its participation in New START</a> – the only remaining agreement between the world’s largest nuclear arsenals.&nbsp;</p><p>Stewart said Monday that the message about the willingness to sit down on arms control had been conveyed at every level.</p></div></article><article id=\"h_88bb0a6e8be4d7b4279bd799256c4c1e\"><header><span>7 hr 44 min ago</span><h2>US Treasury Secretary Janet Yellen makes unannounced trip to Kyiv to reaffirm economic support for Ukraine</h2><p>From CNN's Jennifer Hansler</p></header><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/378106a1-4a56-4ed0-81fc-5711065b5188.jpg\" alt=\"Ukrainian President Volodymyr Zelensky and US Treasury Secretary Janet Yellen shake hands during their meeting in Kyiv, Ukraine, on Monday.\"><figcaption>Ukrainian President Volodymyr Zelensky and US Treasury Secretary Janet Yellen shake hands during their meeting in Kyiv, Ukraine, on Monday. (Ukrainian Presidential Press Office via AP)</figcaption></figure></div><p>US Treasury Secretary Janet Yellen made an unannounced trip to Kyiv Monday “to reaffirm our unwavering support of the Ukrainian people,” she wrote in an opinion piece in the&nbsp;<a href=\"https://www.nytimes.com/2023/02/27/opinion/janet-yellen-ukraine-russia.html?smtyp=cur&smid=tw-nytopinion\" target=\"_blank\">New York Times</a>, stressing US economic support to Ukraine is “more vital than ever.”</p><p>\"We cannot allow Ukraine to lose the war for economic reasons when it has shown an ability to succeed on the battlefield. Ukraine’s military resistance depends on a government that can function effectively, as well as a stable economy that can help finance defense efforts over the long term. By fortifying the ‘home front,’ our economic assistance is helping make possible Ukraine’s stalwart frontline defense against Russia,” she wrote.</p><div><blockquote>“While in Kyiv, Secretary Yellen is announcing the most recent transfer of a tranche of $1.25 billion in economic and budgetary assistance from the U.S. to Ukraine,” a Treasury Department official said.</blockquote></div><p>Yellen met with Ukrainian President Volodymyr Zelensky to discuss ongoing US economic support and “highlighted the efforts of the U.S. and its global coalition to impose severe sanctions on Russia to degrade its war machine and limit the revenue it has to fund its brutal war,” according to a Treasury Department readout.</p><p>Yellen will also meet with Ukrainian Prime Minister Denys Shmyhal, the official said.</p><p>Yellen’s trip comes on the heels of <a href=\"https://www.cnn.com/2023/02/20/politics/biden-ukraine-zelensky-visit-one-year-war-anniversary-intl-hnk/index.html\" target=\"_blank\">US President Joe Biden’s trip to Kyiv</a> last week.</p><p>“Mr. Putin is counting on our global coalition’s resolve to wane, which he thinks will give him the upper hand in the war. But he is wrong. As President Biden said here last week, America will stand with Ukraine for as long as it takes,” Yellen wrote in the New York Times.</p></div></article><article id=\"h_875dc377d2d40567b94f37567e0342c9\"><header><span>8 hr ago</span><h2>After fleeing war, Ukrainian ballet dancers in the Netherlands hope to keep their culture alive</h2><p>From CNN's Maureen Chowdhury </p></header><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f93dc381-616b-45a5-8056-db2bdae7b22c.jpg\" alt=\"The United Ukrainian Ballet performs &quot;Giselle&quot; in August 2022.\"><figcaption>The United Ukrainian Ballet performs \"Giselle\" in August 2022. (Harrison May)</figcaption></figure></div><p>While <a href=\"https://www.cnn.com/specials/europe/ukraine\" target=\"_blank\">Russia's war in Ukraine</a> rages on, a group of refugees in The Hague, Netherlands, have used their talents to help preserve Ukrainian culture and raise awareness for the dire situation in their country.</p><p><a href=\"https://unitedukrainianballet.com/\" target=\"_blank\">The United Ukrainian Ballet</a>&nbsp;was formed soon after Russia invaded Ukraine&nbsp;<a href=\"https://www.cnn.com/2023/02/24/politics/blinken-un-ukraine-war-anniversary/index.html\" target=\"_blank\">just over one year ago</a>. At the time, two Ukrainian dancers, Stanislav Olshanskyi and Alexis Tuttunique, were touring with Dutch prima ballerina Igone de Jongh and the pair sought refuge in The Hague with the help of fellow dancers, according to the non-profit ballet company's website.</p><p>With aid from organizations like the Salvation Army and Senf Theaterpartners, a Dutch production company, provisions were made for a group of Ukrainian dancers and their families to find refuge and training in the Netherlands, Stefan Stolk, producer and managing director of operations of the United Ukrainian Ballet, told CNN.</p><p>Stolk, who works for Senf Theatepartners, said the company had connections to ballet companies in the Ukrainian cities of Kharkiv and Lviv, and were able to get in touch with dancers and let them know about the safe haven.</p><p>The ballet company and its partners, including mayor of The Hague, Jan van Zanen, were able to temporarily secure and renovate the former Hague Conservatory — which was set to be demolished — as a location to house refugees and allow them to continue ballet training.</p><p>Initially the conservatory housed only women dancers and their families, due to Ukraine restricting men ages 18 to 65 from traveling out of the country. By the middle of April 2022, they had about 35 to 40 women, Stolk told CNN. </p><p>At its peak, the conservatory housed more than 200 refugees, 70 to 75 of which were dancers, he added. Today, the company still is home to more than 60 dancers.</p><p><strong>An outlet in a dark time:&nbsp;</strong>Stolk said many dancers came with a heavy weight on their hearts, but once they began training again, \"you could see everyone forget all the sorrow and trouble.\"</p><p>\"I thought, 'This is what we’re working at, this is what we do.' It was really breathtaking,\" he told CNN.</p><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/2c60e502-33ca-4e53-8936-4953423ff00a.jpg\" alt=\"The United Ukrainian Ballet rehearses May 16, 2022.\"><figcaption>The United Ukrainian Ballet rehearses May 16, 2022. (Annemieke van der Togt)</figcaption></figure></div><p>Later in 2022, the company received special permission from the Ukrainian government, with help from Ukrainian first lady Olena Zelenska, to allow some young men to join the company. Stolk said the government sanctioned the exception in an effort “to keep the story alive of Ukraine and Ukrainian culture.\"</p><p>As the number of refugees grew, a foundation was formed to help support and sustain the project's efforts.</p><p><strong>Bringing Ukraine to the world:&nbsp;</strong>Since last March, the company has performed around the world, a feat that would take an average company years to organize. With the help of renowned choreographer Alexei Ratmansky, dancers have performed \"Gisele\" in the Netherlands, London, Singapore and the United States, with plans to perform a new show in Taiwan and other countries later this year.</p><div><blockquote>\"Bringing the story of Ukraine, and that is really what the mission statement is,\" Stolk said. \"We know one thing: When we come perform there in a certain country, we are front page, and this helps to keep this all alive.\"</blockquote></div><p>Stolk said it's important to show the world that Ukraine is more than just the war.</p><p>The company is also trying to make sure that a generation of Ukrainian dancers aren’t forgotten, given that a dancer's career is usually only about 10 years, and many were already stifled by Covid-19 shutdowns before the war broke out.</p><p>“It would be a complete forgotten generation of dancers, and now we give them wings,\" Stolk said.</p><p><strong>A painful anniversary:&nbsp;</strong>While the group's triumphs hearten the refugees, the war still weighs heavy on the dancers as they have daily reminders of the war through contact with loved ones back in Ukraine. Last week brought the&nbsp;<a href=\"https://www.cnn.com/2023/02/24/politics/blinken-un-ukraine-war-anniversary/index.html\" target=\"_blank\">anniversary of Russia’s invasion</a>, and the ballet company dancers requested use of the old conservatory’s main stage area, to perform and be with one another as a form of support.</p><div><blockquote>They said “we want to have a day with each other,\" Stolk said. They performed Ukrainian folk dances, song and read poems, and “no one could keep dry eyes.”</blockquote></div><p>The company's latest show, \"Dancing in Defiance,\" is more catered to the Ukrainian dancers and features three performances. The first performance \"Wartime Elegy\" is described as a celebration of Ukrainian culture. Stolk said it's the choreographer, Kamansty's, response to the war. The music composed for the show also has influence of Ukrainian folk music.</p><p>“It’s tribute to joy,\" Stolk told CNN. \"How people are still there. They are resilient.”</p></div></article><article id=\"h_ba24b02c5ebee9097c30ddc2ca38cca1\"><header><span>8 hr 5 min ago</span><h2>US State Department official: Russia's suspension of New START hasn't come into force yet</h2><p>From CNN's Jennifer Hansler</p></header><div><p>Russia’s suspension of participation in a key nuclear arms control treaty hasn’t come into force yet, a top State Department official said Monday, but she expects certain treaty notifications will cease once it’s finalized.</p><p>“The suspension hasn’t been officially affected yet in the sense that we’re still receiving notifications, as recently as today, under the treaty, regular notifications,” Assistant Secretary for the Bureau of Arms Control, Verification, and Compliance Mallory Stewart said at an event at Brookings Institution.</p><p>“But we expect that as soon as that suspension has been formalized, that those will stop,” she said.&nbsp;</p><p><strong>Some more context: </strong>Russian President Vladimir Putin announced last week that Russia would suspend its participation in New START – the only remaining agreement between the world’s largest nuclear arsenals. US officials have condemned this move as “irresponsible.”</p><p>Stewart said the United States is “trying to follow up” with the Russians “to truly understand what else could be included in the suspension, and what could be continued.”</p><p>“Right now we expect it will just be the launch notifications under that 1988 agreement, and that they said they’ll abide by the actual numerical limitations,” she said.</p><p>Under the treaty, both sides give “pre‑launch notifications of the launch of treaty‑accountable ballistic missiles,” according to the State Department.</p></div></article></div></DIV>",
  "cleaned": "<div><article><span>4 hr 44 min ago</span><h2>European airline will suspend all flights to Moldovan capital due to \"recent developments\"</h2><p>From CNN’s Tim Lister</p><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/443bcd99-cc87-4c00-b98a-c8cdb9c7c003.jpg\" alt=\"Wizz Air passenger aircrafts fly in and out of Berlin Brandenburg Airport in Germany in 2022. \" /><figcaption>Wizz Air passenger aircrafts fly in and out of Berlin Brandenburg Airport in Germany in 2022. (Patrick Pleul/picture-alliance/dpa/AP)</figcaption></figure></div><p>European low-cost carrier Wizz Air is suspending all its flights to the Moldovan capital of Chisinau starting on March 14 due to some “recent developments” in the country, the airline said. </p><div><blockquote>\"As a result of recent developments in Moldova and the high, but not imminent, risk in the country's airspace, Wizz Air has taken the difficult but responsible decision to suspend all flights to Chisinau starting on March 14,” it said in a statement on Monday. </blockquote></div><p>The company didn’t specify the recent developments it was referring to. </p><p>Tensions have been mounting in Moldova, as the country's President Maia Sandu has accused Russia of using “saboteurs” to stoke unrest amid a period of political instability, echoing similar warnings from Ukrainian President Volodymyr Zelensky. </p><p><em>With previous reporting from Radina Gigova.</em></p></div></article><article><span>5 hr 48 min ago</span><h2>NATO bid talks with Sweden and Finland will resume on March 9, Turkish foreign minister says</h2><p>From CNN's Isil Sariyuce and Sugam Pokharel  </p><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/88c3bbea-f813-4c10-b273-6dcfe078c6ec.jpg\" alt=\"Turkish Foreign Minister Mevlut Cavusoglu speaks during a press conference held with his Hungarian counterpart after their meeting in Ankara, Turkey, on February 27.\" /><figcaption>Turkish Foreign Minister Mevlut Cavusoglu speaks during a press conference held with his Hungarian counterpart after their meeting in Ankara, Turkey, on February 27. (Adam Altan/AFP/Getty Images)</figcaption></figure></div><p>Turkey’s talks with Sweden and Finland on the Nordic countries’ NATO accession bid will resume on March 9, Turkish Foreign Minister Mevlut Cavusoglu said on Monday. </p><p>Cavusoglu said in a televised news conference that “there are commitments (Sweden made) for NATO membership. It is not possible for us to say yes to Sweden's NATO membership without seeing these steps.”</p><p><strong>More on the talks: </strong>Ankara in January had suspended talks with Stockholm and Helsinki over the burning of the Quran at a protest in Sweden. </p><p>Sweden and Finland applied last year to join NATO following Russia’s invasion of Ukraine, but all 30 member states, including Turkey, must approve their bids. </p><p>Turkey has said Sweden in particular must first take a clearer stance against what it sees as terrorists, mainly Kurdish militants and a group it blames for a 2016 coup attempt. </p></div></article><article><span>6 hr 39 min ago</span><h2>Ukraine expects the US will provide more than $10 billion in budget support, prime minister says</h2><p>From CNN's Maria Kostenko in Kyiv</p><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/92df6f67-ce8b-41eb-8ccb-51f93693e58d.jpg\" alt=\"US Treasury Secretary Janet Yellen and Ukrainian Prime Minister Denys Shmyhal hold a joint press conference in Kyiv on Monday.\" /><figcaption>US Treasury Secretary Janet Yellen and Ukrainian Prime Minister Denys Shmyhal hold a joint press conference in Kyiv on Monday. (Thibault Camus/AP)</figcaption></figure></div><p>Ukrainian Prime Minister Denys Shmyhal says the country's budget deficit this year is expected to amount to $38 billion, but that the US is committing to provide more than $10 billion in budget support by September.</p><p>Shmyhal was speaking after talks in Kyiv with US Treasury Secretary Janet Yellen.</p><p>\"In 2022, the United States was the leader among all partner countries in terms of financial assistance provided,\" Shmyhal said, providing $13 billion in grant support for the budget.</p><p>\"These funds were allocated for healthcare, education, social and humanitarian aid programs.\"</p><p>This year, he said, \"The United States has committed to provide Ukraine with more than $10 billion by September. In addition, the United States supports Ukraine in its rapid recovery. Namely, they have allocated $1.5 billion for this purpose, and another $1.1 billion to support the rapid recovery of the energy sector of Ukraine and Moldova.\"</p><p>Shmyhal said a new platform was being introduced to help coordinate the work of the G7 countries and international financial organizations, including the IMF and the World Bank, with regard to financial support for Ukraine.\"</p><p>Shmyhal said he and Yellen had also discussed the financial and sanctions impact on the Russian budget. \"We also discussed the continuation and effectiveness of sanctions on the supply of high-tech items to be used in the military sphere of Russia.\"</p></div></article><article><span>6 hr 4 min ago</span><h2>Ukrainian commander says he reiterated need for F-16 fighter aircraft to top US general </h2><p>From Maria Kostenko in Kyiv</p><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e4f7e5c3-7f80-4a8e-a397-10c0a7b61232.JPG\" alt=\"Gen. Valerii Zaluzhnyi attends a ceremony dedicated to the first anniversary of the Russian invasion of Ukraine in Kyiv on Friday.\" /><figcaption>Gen. Valerii Zaluzhnyi attends a ceremony dedicated to the first anniversary of the Russian invasion of Ukraine in Kyiv on Friday. (Ukrainian Presidential Press Service via Reuters)</figcaption></figure></div><p>The commander-in-chief of the Ukrainian Armed Forces said he spoke to the top US general on Monday and reiterated the need to strengthen Kyiv's air defense through the F-16 multi-role fighter aircraft. </p><p>The United States has consistently said that it <a href=\"https://www.cnn.com/2023/02/25/politics/zelensky-republicans-weapons/index.html\" target=\"_blank\">has no plans to send F-16s</a> to Ukraine. </p><p>Gen. Valerii Zaluzhnyi said he also spoke to Gen. Mark Milley about the supply of military equipment, weapons and ammunition, the situation on the front lines, and further plans of the forces regarding the defense of Ukraine.</p><div><blockquote>\"Each shell received — each piece of material — mean the preserved lives of the Ukrainian soldiers and peaceful civilians. We're hanging in there because of the support of our partners and we will definitely prevail,\" Zaluzhnyi added.</blockquote></div></div></article><article><span>7 hr 3 min ago</span><h2>US Treasury secretary says she expects to see \"an increasing toll on Russia’s economic trajectory over time\" </h2><p>From CNN's Alicia Wallace</p><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/81b67017-3e2f-4774-a1b9-7e6ee1b30065.jpg\" alt=\"US Treasury Secretary Janet Yellen speaks during a press conference in Kyiv, Ukraine, on Monday.\" /><figcaption>US Treasury Secretary Janet Yellen speaks during a press conference in Kyiv, Ukraine, on Monday. (Thibault Camus/AP)</figcaption></figure></div><p>While the <a href=\"https://www.cnn.com/2023/02/22/business/russia-economy-ukraine-anniversary/index.html\" target=\"_blank\">Russian economy</a> has not <a href=\"https://www.cnn.com/2023/02/26/business/larry-summers-russia-ukraine-economy/index.html\" target=\"_blank\">yet buckled</a> under the wide array of sanctions from the United States and other Western countries, Treasury Secretary Janet Yellen said Monday she expects it to grow weaker over time as the country loses foreign investment and runs through its reserves and rainy-day funds.</p><div><blockquote>“We will see an increasing toll on Russia’s economic trajectory over time,” <a href=\"https://www.cnn.com/2023/02/27/economy/yellen-inflation-debt-ceiling-ukraine/index.html\" target=\"_blank\">she told CNN</a> in an exclusive interview during her unannounced visit to Kyiv. “And their ability to replenish the military equipment that’s been destroyed in their attacks on Ukraine — that’s been very greatly jeopardized.” </blockquote></div><p>Still, <a href=\"https://www.cnn.com/2023/02/24/politics/us-intelligence-china-drones-russia-ukraine/index.html\" target=\"_blank\">recent US intelligence has shown</a> that China is considering increasing <a href=\"https://www.cnn.com/2023/02/22/economy/china-russia-economic-ties-ukraine-intl-hnk/index.html\" target=\"_blank\">its support of the Russian economy</a> and war efforts, including supplying drones and ammunition.</p><p>Such a move would bring “severe” consequences, Yellen said.</p><p>“We have been extremely clear that we will not tolerate systematic violations by any country of the sanctions that we have put in place that are intended to deprive Russia of access to military equipment to wage this war,” she said. “And we have been very clear with the Chinese government and have made clear to Chinese firms and financial institutions that the consequences of violating those sanctions would be very severe.”</p></div></article><article><span>7 hr 19 min ago</span><h2>US \"very much\" hopes Russia still interested in arms control, State Department official says </h2><p>From CNN's Jennifer Hansler</p><div><p>The United States “very much” hopes that Russia is still interested in arms control, but recent comments by Russian President Vladimir Putin call that interest into question, a top State Department official said Monday.</p><p>“It’s obviously in their domestic interest, and in our interest, and in the global security interest for us to continue to have these discussions,” Assistant Secretary for the Bureau of Arms Control, Verification, and Compliance Mallory Stewart said at an event at Brookings Institution.</p><div><blockquote>“We will meet with them. We need to meet with them. It’s something that both countries need to do to continue to focus on international stability and risk reduction,” she said. </blockquote></div><p>However, Stewart noted that “the communications that we’ve heard from Putin seem to place in doubt the assumptions that we’ve always had that they do value arms control.”</p><p>“By tying it to Ukraine right now, tying it to an immovable object in the sense that our support for Ukraine will not be limited by their New START decision, they’re really placing in doubt their support for the treaty itself,” she said.</p><p><strong>More context: </strong>Putin announced last week that Russia would <a href=\"https://www.cnn.com/2023/02/21/politics/nuclear-weapons-new-start-treaty-what-matters/index.html\" target=\"_blank\">suspend its participation in New START</a> – the only remaining agreement between the world’s largest nuclear arsenals. </p><p>Stewart said Monday that the message about the willingness to sit down on arms control had been conveyed at every level.</p></div></article><article><span>7 hr 44 min ago</span><h2>US Treasury Secretary Janet Yellen makes unannounced trip to Kyiv to reaffirm economic support for Ukraine</h2><p>From CNN's Jennifer Hansler</p><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/378106a1-4a56-4ed0-81fc-5711065b5188.jpg\" alt=\"Ukrainian President Volodymyr Zelensky and US Treasury Secretary Janet Yellen shake hands during their meeting in Kyiv, Ukraine, on Monday.\" /><figcaption>Ukrainian President Volodymyr Zelensky and US Treasury Secretary Janet Yellen shake hands during their meeting in Kyiv, Ukraine, on Monday. (Ukrainian Presidential Press Office via AP)</figcaption></figure></div><p>US Treasury Secretary Janet Yellen made an unannounced trip to Kyiv Monday “to reaffirm our unwavering support of the Ukrainian people,” she wrote in an opinion piece in the <a href=\"https://www.nytimes.com/2023/02/27/opinion/janet-yellen-ukraine-russia.html?smtyp=cur&amp;smid=tw-nytopinion\" target=\"_blank\">New York Times</a>, stressing US economic support to Ukraine is “more vital than ever.”</p><p>\"We cannot allow Ukraine to lose the war for economic reasons when it has shown an ability to succeed on the battlefield. Ukraine’s military resistance depends on a government that can function effectively, as well as a stable economy that can help finance defense efforts over the long term. By fortifying the ‘home front,’ our economic assistance is helping make possible Ukraine’s stalwart frontline defense against Russia,” she wrote.</p><div><blockquote>“While in Kyiv, Secretary Yellen is announcing the most recent transfer of a tranche of $1.25 billion in economic and budgetary assistance from the U.S. to Ukraine,” a Treasury Department official said.</blockquote></div><p>Yellen met with Ukrainian President Volodymyr Zelensky to discuss ongoing US economic support and “highlighted the efforts of the U.S. and its global coalition to impose severe sanctions on Russia to degrade its war machine and limit the revenue it has to fund its brutal war,” according to a Treasury Department readout.</p><p>Yellen will also meet with Ukrainian Prime Minister Denys Shmyhal, the official said.</p><p>Yellen’s trip comes on the heels of <a href=\"https://www.cnn.com/2023/02/20/politics/biden-ukraine-zelensky-visit-one-year-war-anniversary-intl-hnk/index.html\" target=\"_blank\">US President Joe Biden’s trip to Kyiv</a> last week.</p><p>“Mr. Putin is counting on our global coalition’s resolve to wane, which he thinks will give him the upper hand in the war. But he is wrong. As President Biden said here last week, America will stand with Ukraine for as long as it takes,” Yellen wrote in the New York Times.</p></div></article><article><span>8 hr ago</span><h2>After fleeing war, Ukrainian ballet dancers in the Netherlands hope to keep their culture alive</h2><p>From CNN's Maureen Chowdhury </p><div><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f93dc381-616b-45a5-8056-db2bdae7b22c.jpg\" alt=\"The United Ukrainian Ballet performs &quot;Giselle&quot; in August 2022.\" /><figcaption>The United Ukrainian Ballet performs \"Giselle\" in August 2022. (Harrison May)</figcaption></figure></div><p>While <a href=\"https://www.cnn.com/specials/europe/ukraine\" target=\"_blank\">Russia's war in Ukraine</a> rages on, a group of refugees in The Hague, Netherlands, have used their talents to help preserve Ukrainian culture and raise awareness for the dire situation in their country.</p><p><a href=\"https://unitedukrainianballet.com/\" target=\"_blank\">The United Ukrainian Ballet</a> was formed soon after Russia invaded Ukraine <a href=\"https://www.cnn.com/2023/02/24/politics/blinken-un-ukraine-war-anniversary/index.html\" target=\"_blank\">just over one year ago</a>. At the time, two Ukrainian dancers, Stanislav Olshanskyi and Alexis Tuttunique, were touring with Dutch prima ballerina Igone de Jongh and the pair sought refuge in The Hague with the help of fellow dancers, according to the non-profit ballet company's website.</p><p>With aid from organizations like the Salvation Army and Senf Theaterpartners, a Dutch production company, provisions were made for a group of Ukrainian dancers and their families to find refuge and training in the Netherlands, Stefan Stolk, producer and managing director of operations of the United Ukrainian Ballet, told CNN.</p><p>Stolk, who works for Senf Theatepartners, said the company had connections to ballet companies in the Ukrainian cities of Kharkiv and Lviv, and were able to get in touch with dancers and let them know about the safe haven.</p><p>The ballet company and its partners, including mayor of The Hague, Jan van Zanen, were able to temporarily secure and renovate the former Hague Conservatory — which was set to be demolished — as a location to house refugees and allow them to continue ballet training.</p><p>Initially the conservatory housed only women dancers and their families, due to Ukraine restricting men ages 18 to 65 from traveling out of the country. By the middle of April 2022, they had about 35 to 40 women, Stolk told CNN. </p><p>At its peak, the conservatory housed more than 200 refugees, 70 to 75 of which were dancers, he added. Today, the company still is home to more than 60 dancers.</p><p><strong>An outlet in a dark time: </strong>Stolk said many dancers came with a heavy weight on their hearts, but once they began training again, \"you could see everyone forget all the sorrow and trouble.\"</p><p>\"I thought, 'This is what we’re working at, this is what we do.' It was really breathtaking,\" he told CNN.</p><div><figure><img src=\"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/2c60e502-33ca-4e53-8936-4953423ff00a.jpg\" alt=\"The United Ukrainian Ballet rehearses May 16, 2022.\" /><figcaption>The United Ukrainian Ballet rehearses May 16, 2022. (Annemieke van der Togt)</figcaption></figure></div><p>Later in 2022, the company received special permission from the Ukrainian government, with help from Ukrainian first lady Olena Zelenska, to allow some young men to join the company. Stolk said the government sanctioned the exception in an effort “to keep the story alive of Ukraine and Ukrainian culture.\"</p><p>As the number of refugees grew, a foundation was formed to help support and sustain the project's efforts.</p><p><strong>Bringing Ukraine to the world: </strong>Since last March, the company has performed around the world, a feat that would take an average company years to organize. With the help of renowned choreographer Alexei Ratmansky, dancers have performed \"Gisele\" in the Netherlands, London, Singapore and the United States, with plans to perform a new show in Taiwan and other countries later this year.</p><div><blockquote>\"Bringing the story of Ukraine, and that is really what the mission statement is,\" Stolk said. \"We know one thing: When we come perform there in a certain country, we are front page, and this helps to keep this all alive.\"</blockquote></div><p>Stolk said it's important to show the world that Ukraine is more than just the war.</p><p>The company is also trying to make sure that a generation of Ukrainian dancers aren’t forgotten, given that a dancer's career is usually only about 10 years, and many were already stifled by Covid-19 shutdowns before the war broke out.</p><p>“It would be a complete forgotten generation of dancers, and now we give them wings,\" Stolk said.</p><p><strong>A painful anniversary: </strong>While the group's triumphs hearten the refugees, the war still weighs heavy on the dancers as they have daily reminders of the war through contact with loved ones back in Ukraine. Last week brought the <a href=\"https://www.cnn.com/2023/02/24/politics/blinken-un-ukraine-war-anniversary/index.html\" target=\"_blank\">anniversary of Russia’s invasion</a>, and the ballet company dancers requested use of the old conservatory’s main stage area, to perform and be with one another as a form of support.</p><div><blockquote>They said “we want to have a day with each other,\" Stolk said. They performed Ukrainian folk dances, song and read poems, and “no one could keep dry eyes.”</blockquote></div><p>The company's latest show, \"Dancing in Defiance,\" is more catered to the Ukrainian dancers and features three performances. The first performance \"Wartime Elegy\" is described as a celebration of Ukrainian culture. Stolk said it's the choreographer, Kamansty's, response to the war. The music composed for the show also has influence of Ukrainian folk music.</p><p>“It’s tribute to joy,\" Stolk told CNN. \"How people are still there. They are resilient.”</p></div></article><article><span>8 hr 5 min ago</span><h2>US State Department official: Russia's suspension of New START hasn't come into force yet</h2><p>From CNN's Jennifer Hansler</p><div><p>Russia’s suspension of participation in a key nuclear arms control treaty hasn’t come into force yet, a top State Department official said Monday, but she expects certain treaty notifications will cease once it’s finalized.</p><p>“The suspension hasn’t been officially affected yet in the sense that we’re still receiving notifications, as recently as today, under the treaty, regular notifications,” Assistant Secretary for the Bureau of Arms Control, Verification, and Compliance Mallory Stewart said at an event at Brookings Institution.</p><p>“But we expect that as soon as that suspension has been formalized, that those will stop,” she said. </p><p><strong>Some more context: </strong>Russian President Vladimir Putin announced last week that Russia would suspend its participation in New START – the only remaining agreement between the world’s largest nuclear arsenals. US officials have condemned this move as “irresponsible.”</p><p>Stewart said the United States is “trying to follow up” with the Russians “to truly understand what else could be included in the suspension, and what could be continued.”</p><p>“Right now we expect it will just be the launch notifications under that 1988 agreement, and that they said they’ll abide by the actual numerical limitations,” she said.</p><p>Under the treaty, both sides give “pre‑launch notifications of the launch of treaty‑accountable ballistic missiles,” according to the State Department.</p></div></article></div>"
}